server/LoadTests/loadTest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300
      arrivalRate: 0
      rampTo: 100
      name: "Warming Up"
    - duration: 600
      arrivalRate: 100
      rampTo: 200
      name: "Main Load"
    - duration: 300
      arrivalRate: 200
      rampTo: 100
      name: "Cooling Down"
 
scenarios:
  - name: "Stress Test"
    flow:
      - get:
          url: "/games/1/languages"
      - get:
          url: "/games/1/gameInfo"
      - get:
          url: "/reviews/1/users"