server/LoadTests/soakTest.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 120
      arrivalRate: 0
      rampTo: 400
      name: "Warming Up"
    - duration: 1800
      arrivalRate: 400
      name: "Long Soak"
    - duration: 120
      arrivalRate: 400
      rampTo: 0
      name: "Cooling Down"

 
scenarios:
  - name: "Soak Test"
    flow:
      - get:
          url: "/games/1/languages"
      - get:
          url: "/games/1/gameInfo"
      - get:
          url: "/reviews/1/users"